package com.company.leetcode;

import java.util.Arrays;

/**
 * 628. 三个数的最大乘积
 * <p>
 * 给你一个整型数组 nums ，在数组中找出由三个数组成的最大乘积，并输出这个乘积。
 * <p>
 * 示例 1：
 * <p>
 * 输入：nums = [1,2,3]
 * 输出：6
 * <p>
 * 示例 2：
 * <p>
 * 输入：nums = [1,2,3,4]
 * 输出：24
 * <p>
 * 示例 3：
 * <p>
 * 输入：nums = [-1,-2,-3]
 * 输出：-6
 * <p>
 * <p>
 * 提示：
 * <p>
 * 3 <= nums.length <= 10⁴
 * -1000 <= nums[i] <= 1000
 * <p>
 * Related Topics 数组 数学 排序 👍 365 👎 0
 *
 * @author 王渔
 * @date 2022/3/21 14:44
 */
public class MaximumProductThreeNumbers {
    public static void main(String[] args) {
//        System.out.println(new Solution().maximumProduct(new int[]{-1, -2, -3, -4}));
        System.out.println(new Solution().maximumProduct(new int[]{-710, -107, -851, 657, -14, -859, 278, -182, -749, 718, -640, 127, -930, -462, 694, 969, 143, 309, 904, -651, 160, 451, -159, -316, 844, -60, 611, -169, -73, 721, -902, 338, -20, -890, -819, -644, 107, 404, 150, -219, 459, -324, -385, -118, -307, 993, 202, -147, 62, -94, -976, -329, 689, 870, 532, -686, 371, -850, -186, 87, 878, 989, -822, -350, -948, -412, 161, -88, -509, 836, -207, -60, 771, 516, -287, -366, -512, 509, 904, -459, 683, -563, -766, -837, -333, 93, 893, 303, 908, 532, -206, 990, 280, 826, -13, 115, -732, 525, -939, -787}));
    }

    static class Solution {
        public int maximumProduct(int[] nums) {
            Arrays.sort(nums);
            //排序后的最大乘积有两种情况：1.最大的三个数相乘。2.最小的两个负数相乘再乘最大的正数
            return Math.max(nums[nums.length - 1] * nums[nums.length - 2] * nums[nums.length - 3], nums[0] * nums[1] * nums[nums.length - 1]);
        }
    }
}
